app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page])
---
SELECT  "posts".* FROM "posts" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"